Revit 2025 API
ComponentRotation Enumeration
ComponentRotation property of DividedSurface. See DividedSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ComponentRotation
Public Enumeration ComponentRotation
public enum class ComponentRotation
type ComponentRotation
Members
Member name | Value | Description
Angle0 | 0
Angle90 | 90
Angle180 | 180
Angle270 | 270
See Also
Reference
Autodesk.Revit.DB Namespace